Programming/circular-buffer.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <script type="text/javascript">disableSearch();</script>
#+TITLE: Circular Buffer
#+AUTHOR: Dean Seo (deaniac.seo@gmail.com)
#+DATE:  [2020-01-11 토]
#+HTML_HEAD: <style> #content{max-width:900px;}</style>>
#+OPTIONS: timestamp:nil
#+OPTIONS: num:nil

* Table of Contents
- [[#circular-buffer][Circular Buffer]]
  - [[#how-does-it-work][How does it work?]]
    - [[#a-very-simple-circular-buffer-for-a-single-thread][A (very) simple Circular Buffer for a single thread]]
    - [[#spscsingle-producer-single-consumer-circular-buffer][SPSC(Single-Producer Single-Consumer) Circular Buffer]]
    - [[#mpmcmulti-producer-multi-consumer-circular-buffer][MPMC(Multi-Producer Multi-Consumer) Circular Buffer]]

* Circular Buffer
:PROPERTIES:
:CUSTOM_ID: circular-buffer
:END:
*Circular Buffer* is one of the most often used data structure in /real world/.
Most buy-side firms probably have one or two in-house implementations and it's often even used during the live coding assessment.

This implementation can be also used in my previous post about [[file:transaction-limitter.org][Transaction Limitter]] where you limit the total number of orders submitted per second.

So yeah, Circular Buffer is useful with interesting traits.
There are several ways to implement it, depending on how you define the requirements, as follows:

- Does it have to be thread-safe?
- How many producers consumers are accessing the buffer simultaneously?

** How does it work?
:PROPERTIES:
:CUSTOM_ID: how-does-it-work
:END:
Circular Buffer has two important trait that:
1) The buffer has a fixed total size
2) The next node of the last node in the buffer points to the very first node

This design takes away the burden of taking care of the index where we can simply keep incrementing when a new node is stored.
We need two variables representing =head= and =tail.=

Every new node stored, there's one increment on =head=.
Likewise, every new node loaded, there's one icrement on =tail=.

Let's have a look at one of the simplest possible implementation:
