Programming/circular-buffer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Circular Buffer</title>
<meta name="author" content="Dean Seo (deaniac.seo@gmail.com)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Circular Buffer</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1c0300d">Table of Contents</a></li>
<li><a href="#circular-buffer">Circular Buffer</a>
<ul>
<li><a href="#how-does-it-work">How does it work?</a>
<ul>
<li><a href="#a-very-simple-circular-buffer-for-a-single-thread">A (very) simple Circular Buffer for a single thread</a></li>
<li><a href="#spscsingle-producer-single-consumer-circular-buffer">SPSC(Single-Producer Single-Consumer) Circular Buffer</a></li>
<li><a href="#mpmcmulti-producer-multi-consumer-circular-buffer">MPMC(Multi-Producer Multi-Consumer) Circular Buffer</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1c0300d" class="outline-2">
<h2 id="org1c0300d">Table of Contents</h2>
<div class="outline-text-2" id="text-org1c0300d">
<ul class="org-ul">
<li><a href="#circular-buffer">Circular Buffer</a>
<ul class="org-ul">
<li><a href="#how-does-it-work">How does it work?</a>
<ul class="org-ul">
<li><a href="#a-very-simple-circular-buffer-for-a-single-thread">A (very) simple Circular Buffer for a single thread</a></li>
<li><a href="#spscsingle-producer-single-consumer-circular-buffer">SPSC(Single-Producer Single-Consumer) Circular Buffer</a></li>
<li><a href="#mpmcmulti-producer-multi-consumer-circular-buffer">MPMC(Multi-Producer Multi-Consumer) Circular Buffer</a></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-circular-buffer" class="outline-2">
<h2 id="circular-buffer">Circular Buffer</h2>
<div class="outline-text-2" id="text-circular-buffer">
<p>
<b>Circular Buffer</b> is one of the most often used data structure in <i>real world</i>.
Most buy-side firms probably have one or two in-house implementations and it's often even used during the live coding assessment.
</p>

<p>
This implementation can be also used in my previous post about <a href="transaction-limitter.html">Transaction Limitter</a> where you limit the total number of orders submitted per second.
</p>

<p>
So yeah, Circular Buffer is useful with interesting traits.
There are several ways to implement it, depending on how you define the requirements, as follows:
</p>

<ul class="org-ul">
<li>Does it have to be thread-safe?</li>
<li>How many producers consumers are accessing the buffer simultaneously?</li>
</ul>
</div>

<div id="outline-container-how-does-it-work" class="outline-3">
<h3 id="how-does-it-work">How does it work?</h3>
<div class="outline-text-3" id="text-how-does-it-work">
<p>
Circular Buffer has two important trait that:
</p>
<ol class="org-ol">
<li>The buffer has a fixed total size</li>
<li>The next node of the last node in the buffer points to the very first node</li>
</ol>

<p>
This design takes away the burden of taking care of the index where we can simply keep incrementing when a new node is stored.
We need two variables representing <code>head</code> and <code>tail.</code>
</p>

<p>
Every new node stored, there's one increment on <code>head</code>.
Likewise, every new node loaded, there's one icrement on <code>tail</code>.
</p>

<p>
Let's have a look at one of the simplest possible implementation:
</p>
</div>
