Programming/circular-buffer.org
*** A (very) simple Circular Buffer for a single thread
:PROPERTIES:
:CUSTOM_ID: a-very-simple-circular-buffer-for-a-single-thread
:END:
This offers the two minimal functionalities of circular buffer:
#+BEGIN_SRC C++ :includes <iostream> <vector> :flags -std=c++20 :results silent raw :exports both :main no :noweb yes
  template <typename T>
  class circular_buffer {
  public:
      circular_buffer(size_t size) : buf_(std::vector<T>(size)), max_size_(size) {}

      bool put(const T& item) {
          if ((head_ + 1) % max_size_ == tail_) {
              // Buffer is full, cannot add new item
              return false;
          }
          buf_[head_] = item;
          head_ = (head_ + 1) % max_size_;
          return true;
      }

      bool get(T& item) {
          if (tail_ == head_) {
              // Buffer is empty, no items to retrieve
              return false;
          }
          item = buf_[tail_];
          tail_ = (tail_ + 1) % max_size_;
          return true;
      }

  private:
      std::vector<T> buf_;    // Storage buffer
      size_t head_ = 0;       // Index of the next write position
      size_t tail_ = 0;       // Index of the next read position
      size_t max_size_;       // Maximum capacity of the buffer
  };
#+END_SRC

Let's say you're calling =push= and =get= as follows:
#+BEGIN_SRC C++ :includes <iostream> :flags -std=c++20 :results silent raw :exports both :main no :noweb yes
  circular_buffer<int> cb(3); // Create a circular buffer with capacity 3

  cb.put(1);
  cb.put(2);
  cb.put(3);

  int element_1, element_2, element_3;

  cb.get(element_1);
  cb.get(element_2);
  cb.get(element_3);
#+END_SRC

This is a conceptual diagram:
#+begin_example
  +--------+                        +----------------+                        +--------+
  | Client |                        | CircularBuffer |                        | Vector |
  +--------+                        +----------------+                        +--------+
       |                                     |                                     |
       |---------new CircularBuffer(3)------>|                                     |
       |<------------------------------------|                                     |
       |                                     |--------Initialize Vector[3]-------->|
       |                                     |<------------------------------------|
       |                                     |                                     |
       |---put(1)--------------------------->|                                     |
       |                                     |-Check if buffer is not full         |
       |                                     |-Store 1 at index 0                  |
       |                                     |----Update head--------------------->|
       |                                     |                                     |
       |---put(2)--------------------------->|                                     |
       |                                     |-Check if buffer is not full         |
       |                                     |-Store 2 at index 1                  |
       |                                     |----Update head--------------------->|
       |                                     |                                     |
       |---get(item)------------------------>|                                     |
       |                                     |-Check if buffer is not empty        |
       |                                     |<---Retrieve item from index 0-------|
       |                                     |----Update tail--------------------->|
       |<---return item (1)------------------|                                     |
       |                                     |                                     |
       |---get(item)------------------------>|                                     |
       |                                     |-Check if buffer is not empty        |
       |                                     |<---Retrieve item from index 1-------|
       |                                     |----Update tail--------------------->|
       |<---return item (2)------------------|                                     |
       |                                     |                                     |
       -----------------------------------------------------------------------------
#+end_example

This implementation does what it does, but one pitfall is that it's _NOT_ thread-safe.
For multi-threaded applications, we need either of the followings:
- SPSC(Single-Producer Single-Consumer) Circular Buffer
- MPMC(Multi-Producer Multi-Consumer) circular Buffer

