Programming/circular-buffer.html
<div id="outline-container-a-very-simple-circular-buffer-for-a-single-thread" class="outline-4">
<h4 id="a-very-simple-circular-buffer-for-a-single-thread">A (very) simple Circular Buffer for a single thread</h4>
<div class="outline-text-4" id="text-a-very-simple-circular-buffer-for-a-single-thread">
<p>
This offers the two minimal functionalities of circular buffer:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">template</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">class</span> <span class="org-type">circular_buffer</span> <span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-keyword">public</span>:
    <span class="org-function-name">circular_buffer</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">size_t</span> <span class="org-variable-name">size</span><span class="org-rainbow-delimiters-depth-2">)</span> : buf_<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::vector<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span>size<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>, max_size_<span class="org-rainbow-delimiters-depth-2">(</span>size<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>

    <span class="org-type">bool</span> <span class="org-function-name">put</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">T</span>&amp; <span class="org-variable-name">item</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>head_ + 1<span class="org-rainbow-delimiters-depth-4">)</span> % max_size_ == tail_<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-comment-delimiter">// </span><span class="org-comment">Buffer is full, cannot add new item</span>
            <span class="org-keyword">return</span> <span class="org-constant">false</span>;
        <span class="org-rainbow-delimiters-depth-3">}</span>
        buf_<span class="org-rainbow-delimiters-depth-3">[</span>head_<span class="org-rainbow-delimiters-depth-3">]</span> = item;
        head_ = <span class="org-rainbow-delimiters-depth-3">(</span>head_ + 1<span class="org-rainbow-delimiters-depth-3">)</span> % max_size_;
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

    <span class="org-type">bool</span> <span class="org-function-name">get</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">T</span>&amp; <span class="org-variable-name">item</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>tail_ == head_<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-comment-delimiter">// </span><span class="org-comment">Buffer is empty, no items to retrieve</span>
            <span class="org-keyword">return</span> <span class="org-constant">false</span>;
        <span class="org-rainbow-delimiters-depth-3">}</span>
        item = buf_<span class="org-rainbow-delimiters-depth-3">[</span>tail_<span class="org-rainbow-delimiters-depth-3">]</span>;
        tail_ = <span class="org-rainbow-delimiters-depth-3">(</span>tail_ + 1<span class="org-rainbow-delimiters-depth-3">)</span> % max_size_;
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-keyword">private</span>:
    <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">buf_</span>;    <span class="org-comment-delimiter">// </span><span class="org-comment">Storage buffer</span>
    <span class="org-type">size_t</span> <span class="org-variable-name">head_</span> = 0;       <span class="org-comment-delimiter">// </span><span class="org-comment">Index of the next write position</span>
    <span class="org-type">size_t</span> <span class="org-variable-name">tail_</span> = 0;       <span class="org-comment-delimiter">// </span><span class="org-comment">Index of the next read position</span>
    <span class="org-type">size_t</span> <span class="org-variable-name">max_size_</span>;       <span class="org-comment-delimiter">// </span><span class="org-comment">Maximum capacity of the buffer</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
Let's say you're calling <code>push</code> and <code>get</code> as follows:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span class="org-type">circular_buffer</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-1">&gt;</span> <span class="org-variable-name">cb</span><span class="org-rainbow-delimiters-depth-1">(</span>3<span class="org-rainbow-delimiters-depth-1">)</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Create a circular buffer with capacity 3</span>

cb.put<span class="org-rainbow-delimiters-depth-1">(</span>1<span class="org-rainbow-delimiters-depth-1">)</span>;
cb.put<span class="org-rainbow-delimiters-depth-1">(</span>2<span class="org-rainbow-delimiters-depth-1">)</span>;
cb.put<span class="org-rainbow-delimiters-depth-1">(</span>3<span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-type">int</span> <span class="org-variable-name">element_1</span>, <span class="org-variable-name">element_2</span>, <span class="org-variable-name">element_3</span>;

cb.get<span class="org-rainbow-delimiters-depth-1">(</span>element_1<span class="org-rainbow-delimiters-depth-1">)</span>;
cb.get<span class="org-rainbow-delimiters-depth-1">(</span>element_2<span class="org-rainbow-delimiters-depth-1">)</span>;
cb.get<span class="org-rainbow-delimiters-depth-1">(</span>element_3<span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>

<p>
This is a conceptual diagram:
</p>
<pre class="example" id="org1620e07">
+--------+                        +----------------+                        +--------+
| Client |                        | CircularBuffer |                        | Vector |
+--------+                        +----------------+                        +--------+
     |                                     |                                     |
     |---------new CircularBuffer(3)------&gt;|                                     |
     |&lt;------------------------------------|                                     |
     |                                     |--------Initialize Vector[3]--------&gt;|
     |                                     |&lt;------------------------------------|
     |                                     |                                     |
     |---put(1)---------------------------&gt;|                                     |
     |                                     |-Check if buffer is not full         |
     |                                     |-Store 1 at index 0                  |
     |                                     |----Update head---------------------&gt;|
     |                                     |                                     |
     |---put(2)---------------------------&gt;|                                     |
     |                                     |-Check if buffer is not full         |
     |                                     |-Store 2 at index 1                  |
     |                                     |----Update head---------------------&gt;|
     |                                     |                                     |
     |---get(item)------------------------&gt;|                                     |
     |                                     |-Check if buffer is not empty        |
     |                                     |&lt;---Retrieve item from index 0-------|
     |                                     |----Update tail---------------------&gt;|
     |&lt;---return item (1)------------------|                                     |
     |                                     |                                     |
     |---get(item)------------------------&gt;|                                     |
     |                                     |-Check if buffer is not empty        |
     |                                     |&lt;---Retrieve item from index 1-------|
     |                                     |----Update tail---------------------&gt;|
     |&lt;---return item (2)------------------|                                     |
     |                                     |                                     |
     -----------------------------------------------------------------------------
</pre>

<p>
This implementation does what it does, but one pitfall is that it's <span class="underline">NOT</span> thread-safe.
For multi-threaded applications, we need either of the followings:
</p>
<ul class="org-ul">
<li>SPSC(Single-Producer Single-Consumer) Circular Buffer</li>
<li>MPMC(Multi-Producer Multi-Consumer) circular Buffer</li>
</ul>
</div>
</div>
