Programming/circular-buffer.org
*** SPSC(Single-Producer Single-Consumer) Circular Buffer
:PROPERTIES:
:CUSTOM_ID: spscsingle-producer-single-consumer-circular-buffer
:END:
To make it thread-safe, it's important to define how many writers and readers are simultaneously accessing the circular buffer.
#+BEGIN_SRC C++ :includes <iostream> <atomic> <vector>:flags -std=c++20 :results silent raw :exports both :main no :noweb yes
  template <typename T>
  class circular_buffer {
  public:
      circular_buffer(size_t size) 
          : buf_(std::vector<T>(size)), max_size_(size), head_(0), tail_(0) {}

      bool put(const T& item) {
          size_t head = head_.load(std::memory_order_relaxed);
          size_t next_head = (head + 1) % max_size_;
          if (next_head == tail_.load(std::memory_order_acquire)) {
              return false;  // Buffer is full
          }
          buf_[head] = item;
          head_.store(next_head, std::memory_order_release);
          return true;
      }

      bool get(T& item) {
          size_t tail = tail_.load(std::memory_order_relaxed);
          if (tail == head_.load(std::memory_order_acquire)) {
              return false;  // Buffer is empty
          }
          item = buf_[tail];
          tail_.store((tail + 1) % max_size_, std::memory_order_release);
          return true;
      }

  private:
      std::vector<T> buf_;
      size_t max_size_;
      std::atomic<size_t> head_, tail_;
  };
#+END_SRC

Given that it's running on x86, with a single thread at each producer and consumer,
our primary /logical/ challenge is to make sure the compiler from reordering.

Using *GCC 13.2*, let's see whether the modification order remains untouched.

For =put= function, it looks good, as follows:
#+BEGIN_SRC asm
  /* bool put(const T& item) */

  // size_t head = head_.load(std::memory_order_relaxed);
     mov     rcx, QWORD PTR [rsp+32]
  // size_t next_head = (head + 1) % max_size_;
     lea     rax, [rcx+1]
     div     QWORD PTR [rsp+24]
  // if (next_head == tail_.load(std::memory_order_acquire))
     mov     rax, QWORD PTR [rsp+40]
     cmp     rdx, rax
     je      .L2 
  // buf_[head] = item;
     mov     rax, QWORD PTR [rsp]
     mov     DWORD PTR [rax+rcx*4], ebx
  // head_.store(next_head, std::memory_order_release);
     mov     QWORD PTR [rsp+32], rdx
#+END_SRC

For =get= function, it looks as good, as follows:
#+BEGIN_SRC asm
  /* bool get(T& item) */

  // size_t tail = tail_.load(std::memory_order_relaxed);
     mov     rax, QWORD PTR [rsp+40]
  // if (tail == head_.load(std::memory_order_acquire))
     mov     rdx, QWORD PTR [rsp+32]
     cmp     rax, rdx
     je      .L2 // Nope, return false
  // (tail + 1) % max_size_
     add     rax, 1
     xor     edx, edx // 'div' preparation
     div     QWORD PTR [rsp+24]
  // tail_.store(result);
     mov     QWORD PTR [rsp+40], rdx
#+END_SRC

I will skip the =main= function part as it should be straight-forward like the [[#a-very-simple-circular-buffer-for-a-single-thread][simple]] version above.

