Programming/circular-buffer.html

<div id="outline-container-spscsingle-producer-single-consumer-circular-buffer" class="outline-4">
<h4 id="spscsingle-producer-single-consumer-circular-buffer">SPSC(Single-Producer Single-Consumer) Circular Buffer</h4>
<div class="outline-text-4" id="text-spscsingle-producer-single-consumer-circular-buffer">
<p>
To make it thread-safe, it's important to define how many writers and readers are simultaneously accessing the circular buffer.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">template</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">class</span> <span class="org-type">circular_buffer</span> <span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-keyword">public</span>:
    <span class="org-function-name">circular_buffer</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">size_t</span> <span class="org-variable-name">size</span><span class="org-rainbow-delimiters-depth-2">)</span> 
        : buf_<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::vector<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span>size<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>, max_size_<span class="org-rainbow-delimiters-depth-2">(</span>size<span class="org-rainbow-delimiters-depth-2">)</span>, head_<span class="org-rainbow-delimiters-depth-2">(</span>0<span class="org-rainbow-delimiters-depth-2">)</span>, tail_<span class="org-rainbow-delimiters-depth-2">(</span>0<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>

    <span class="org-type">bool</span> <span class="org-function-name">put</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">T</span>&amp; <span class="org-variable-name">item</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-type">size_t</span> <span class="org-variable-name">head</span> = head_.load<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-type">size_t</span> <span class="org-variable-name">next_head</span> = <span class="org-rainbow-delimiters-depth-3">(</span>head + 1<span class="org-rainbow-delimiters-depth-3">)</span> % max_size_;
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>next_head == tail_.load<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">std</span>::memory_order_acquire<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-keyword">return</span> <span class="org-constant">false</span>;  <span class="org-comment-delimiter">// </span><span class="org-comment">Buffer is full</span>
        <span class="org-rainbow-delimiters-depth-3">}</span>
        buf_<span class="org-rainbow-delimiters-depth-3">[</span>head<span class="org-rainbow-delimiters-depth-3">]</span> = item;
        head_.store<span class="org-rainbow-delimiters-depth-3">(</span>next_head, <span class="org-constant">std</span>::memory_order_release<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

    <span class="org-type">bool</span> <span class="org-function-name">get</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">T</span>&amp; <span class="org-variable-name">item</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-type">size_t</span> <span class="org-variable-name">tail</span> = tail_.load<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-3">(</span>tail == head_.load<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">std</span>::memory_order_acquire<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            <span class="org-keyword">return</span> <span class="org-constant">false</span>;  <span class="org-comment-delimiter">// </span><span class="org-comment">Buffer is empty</span>
        <span class="org-rainbow-delimiters-depth-3">}</span>
        item = buf_<span class="org-rainbow-delimiters-depth-3">[</span>tail<span class="org-rainbow-delimiters-depth-3">]</span>;
        tail_.store<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">(</span>tail + 1<span class="org-rainbow-delimiters-depth-4">)</span> % max_size_, <span class="org-constant">std</span>::memory_order_release<span class="org-rainbow-delimiters-depth-3">)</span>;
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-keyword">private</span>:
    <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">buf_</span>;
    <span class="org-type">size_t</span> <span class="org-variable-name">max_size_</span>;
    <span class="org-constant">std</span>::<span class="org-type">atomic</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">size_t</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">head_</span>, <span class="org-variable-name">tail_</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
Given that it's running on x86, with a single thread at each producer and consumer,
our primary <i>logical</i> challenge is to make sure the compiler from reordering.
</p>

<p>
Using <b>GCC 13.2</b>, let's see whether the modification order remains untouched.
</p>

<p>
For <code>put</code> function, it looks good, as follows:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">/* </span><span class="org-comment">bool put(const T&amp; item)</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">size_t head = head_.load(std::memory_order_relaxed);</span>
   <span class="org-keyword">mov</span>     rcx, QWORD PTR [rsp+32]
<span class="org-comment-delimiter">// </span><span class="org-comment">size_t next_head = (head + 1) % max_size_;</span>
   <span class="org-keyword">lea</span>     rax, [rcx+1]
   <span class="org-keyword">div</span>     QWORD PTR [rsp+24]
<span class="org-comment-delimiter">// </span><span class="org-comment">if (next_head == tail_.load(std::memory_order_acquire))</span>
   <span class="org-keyword">mov</span>     rax, QWORD PTR [rsp+40]
   <span class="org-keyword">cmp</span>     rdx, rax
   <span class="org-keyword">je</span>      .L2 
<span class="org-comment-delimiter">// </span><span class="org-comment">buf_[head] = item;</span>
   <span class="org-keyword">mov</span>     rax, QWORD PTR [rsp]
   <span class="org-keyword">mov</span>     DWORD PTR [rax+rcx*4], ebx
<span class="org-comment-delimiter">// </span><span class="org-comment">head_.store(next_head, std::memory_order_release);</span>
   <span class="org-keyword">mov</span>     QWORD PTR [rsp+32], rdx
</pre>
</div>

<p>
For <code>get</code> function, it looks as good, as follows:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">/* </span><span class="org-comment">bool get(T&amp; item)</span><span class="org-comment-delimiter"> */</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">size_t tail = tail_.load(std::memory_order_relaxed);</span>
   <span class="org-keyword">mov</span>     rax, QWORD PTR [rsp+40]
<span class="org-comment-delimiter">// </span><span class="org-comment">if (tail == head_.load(std::memory_order_acquire))</span>
   <span class="org-keyword">mov</span>     rdx, QWORD PTR [rsp+32]
   <span class="org-keyword">cmp</span>     rax, rdx
   <span class="org-keyword">je</span>      .L2 <span class="org-comment-delimiter">// </span><span class="org-comment">Nope, return false</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">(tail + 1) % max_size_</span>
   <span class="org-keyword">add</span>     rax, 1
   <span class="org-keyword">xor</span>     edx, edx <span class="org-comment-delimiter">// </span><span class="org-comment">'div' preparation</span>
   <span class="org-keyword">div</span>     QWORD PTR [rsp+24]
<span class="org-comment-delimiter">// </span><span class="org-comment">tail_.store(result);</span>
   <span class="org-keyword">mov</span>     QWORD PTR [rsp+40], rdx
</pre>
</div>

<p>
I will skip the <code>main</code> function part as it should be straight-forward like the <a href="#a-very-simple-circular-buffer-for-a-single-thread">simple</a> version above.
</p>
</div>
</div>
