Programming/circular-buffer.org
*** MPMC(Multi-Producer Multi-Consumer) Circular Buffer
:PROPERTIES:
:CUSTOM_ID: mpmcmulti-producer-multi-consumer-circular-buffer
:END:
#+begin_note
*Disclaimer*

I didn't take it into consideration making it /portable/, at least for now.
It takes a whole lot of different efforts with additional difficulties beyond the very subject here.

In my opinion, I'm not quite sure whether the current C++ memory model guarantees to cover all cases in different platforms.
Even if it does, I don't think it can be done in an intuitive manner.
#+end_note

Note that [[https://youtu.be/ZQFzMfHIxng?si=50MKH9QjIqL0vBAr&t=2108][x86 does a straight, brute-force for exclusive reads]] until it returns a CAS loop.
Therefore, a simple 'weak' CAS can do the job.
#+BEGIN_SRC C++ :includes <iostream> <atomic> <vector>:flags -std=c++20 :results silent raw :exports both :main no :noweb yes
  template <typename T>
  class circular_buffer {
  public:
      circular_buffer(size_t size) 
          : buf_(std::vector<T>(size)), max_size_(size), head_(0), tail_(0) {}

      bool put(const T& item) {
          size_t head, next_head;
          do {
              head = head_.load(std::memory_order_relaxed);
              next_head = (head + 1) % max_size_;
              if (next_head == tail_.load(std::memory_order_acquire)) {
                  return false; // Buffer is full
              }

              // Attempt to update head
          } while (!head_.compare_exchange_weak(head, next_head, 
                                                std::memory_order_release,
                                                std::memory_order_relaxed));
          buf_[head] = item;
          return true;
      }

      bool get(T& item) {
          size_t tail, next_tail;
          do {
              tail = tail_.load(std::memory_order_relaxed);
              if (tail == head_.load(std::memory_order_acquire)) {
                  return false; // Buffer is empty
              }
              next_tail = (tail + 1) % max_size_;

              // Attempt to update tail
          } while (!tail_.compare_exchange_weak(tail, next_tail, 
                                                std::memory_order_release,
                                                std::memory_order_relaxed));
          item = buf_[tail];
          return true;
      }

  private:
      std::vector<T> buf_;
      size_t max_size_;
      std::atomic<size_t> head_, tail_;
  };
#+END_SRC

Likewise, I am skipping the =main= function part. \\
Using GCC 13.2, this is x86 assembly for =put=:
#+BEGIN_SRC asm
  // head = head_.load(std::memory_order_relaxed);
     mov     rcx, QWORD PTR [rsp+32]

  // next_head = (head + 1) % max_size_;
     xor     edx, edx // 'div' preparation
     lea     rax, [rcx+1]
     div     QWORD PTR [rsp+24] 

  // tail_.load(std::memory_order_acquire)
     mov     rax, QWORD PTR [rsp+40] 

  // if (next_head == tail_) {
     cmp     rdx, rax
     je      .L13 // Return false

  // while (!head_.compare_exchange_weak(head, next_head, memory_order_release, memory_order_relaxed)
     mov     rax, rcx
     lock cmpxchg    QWORD PTR [rsp+32], rdx
     jne     .L4  

  // buf_[head] = item;
     mov     rdi, QWORD PTR [rsp]
     mov     DWORD PTR [rdi+rax*4], 1
#+END_SRC

This is for =get=, by the same compiler, as follows:
#+BEGIN_SRC asm
  // tail = tail_.load(std::memory_order_relaxed);
     mov     rcx, QWORD PTR [rsp+40]
  // head_.load(std::memory_order_acquire)
     mov     rax, QWORD PTR [rsp+32]
  // if (tail == head_.load(std::memory_order_acquire)) {
     cmp     rcx, rax
     je      .L4
  // next_tail = (tail + 1) % max_size_;
     lea     rax, [rcx+1]
     xor     edx, edx
     div     QWORD PTR [rsp+24]
  // while (!tail_.compare_exchange_weak(tail, next_tail, memory_order_release, memory_order_relaxed)
     mov     rax, rcx  # _25, _25
     lock cmpxchg    QWORD PTR [rsp+40], rdx
     jne     .L5
#+END_SRC

No modification order is changed by the compiler.
Note that =cmpxchg= is used with =lock= prefix. This is an alternative to =mfence= in x86 which is [[https://preshing.com/20120515/memory-reordering-caught-in-the-act/][more expensive as a full memory berrier]].


















