Programming/circular-buffer.html

<div id="outline-container-mpmcmulti-producer-multi-consumer-circular-buffer" class="outline-4">
<h4 id="mpmcmulti-producer-multi-consumer-circular-buffer">MPMC(Multi-Producer Multi-Consumer) Circular Buffer</h4>
<div class="outline-text-4" id="text-mpmcmulti-producer-multi-consumer-circular-buffer">
<div class="note" id="orgcd5f449">
<p>
<b>Disclaimer</b>
</p>

<p>
I didn't take it into consideration making it <i>portable</i>, at least for now.
It takes a whole lot of different efforts with additional difficulties beyond the very subject here.
</p>

<p>
In my opinion, I'm not quite sure whether the current C++ memory model guarantees to cover all cases in different platforms.
Even if it does, I don't think it can be done in an intuitive manner.
</p>

</div>

<p>
Note that <a href="https://youtu.be/ZQFzMfHIxng?si=50MKH9QjIqL0vBAr&amp;t=2108">x86 does a straight, brute-force for exclusive reads</a> until it returns a CAS loop.
Therefore, a simple 'weak' CAS can do the job.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">template</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-keyword">typename</span> <span class="org-type">T</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>
<span class="org-keyword">class</span> <span class="org-type">circular_buffer</span> <span class="org-rainbow-delimiters-depth-1">{</span>
<span class="org-keyword">public</span>:
    <span class="org-function-name">circular_buffer</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">size_t</span> <span class="org-variable-name">size</span><span class="org-rainbow-delimiters-depth-2">)</span> 
        : buf_<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-constant">std</span>::vector<span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-3">&gt;(</span>size<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>, max_size_<span class="org-rainbow-delimiters-depth-2">(</span>size<span class="org-rainbow-delimiters-depth-2">)</span>, head_<span class="org-rainbow-delimiters-depth-2">(</span>0<span class="org-rainbow-delimiters-depth-2">)</span>, tail_<span class="org-rainbow-delimiters-depth-2">(</span>0<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{}</span>

    <span class="org-type">bool</span> <span class="org-function-name">put</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">const</span> <span class="org-type">T</span>&amp; <span class="org-variable-name">item</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-type">size_t</span> <span class="org-variable-name">head</span>, <span class="org-variable-name">next_head</span>;
        <span class="org-keyword">do</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            head = head_.load<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-4">)</span>;
            next_head = <span class="org-rainbow-delimiters-depth-4">(</span>head + 1<span class="org-rainbow-delimiters-depth-4">)</span> % max_size_;
            <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-4">(</span>next_head == tail_.load<span class="org-rainbow-delimiters-depth-5">(</span><span class="org-constant">std</span>::memory_order_acquire<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-rainbow-delimiters-depth-4">{</span>
                <span class="org-keyword">return</span> <span class="org-constant">false</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Buffer is full</span>
            <span class="org-rainbow-delimiters-depth-4">}</span>

            <span class="org-comment-delimiter">// </span><span class="org-comment">Attempt to update head</span>
        <span class="org-rainbow-delimiters-depth-3">}</span> <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-negation-char">!</span>head_.compare_exchange_weak<span class="org-rainbow-delimiters-depth-4">(</span>head, next_head, 
                                              <span class="org-constant">std</span>::memory_order_release,
                                              <span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
        buf_<span class="org-rainbow-delimiters-depth-3">[</span>head<span class="org-rainbow-delimiters-depth-3">]</span> = item;
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

    <span class="org-type">bool</span> <span class="org-function-name">get</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">T</span>&amp; <span class="org-variable-name">item</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-type">size_t</span> <span class="org-variable-name">tail</span>, <span class="org-variable-name">next_tail</span>;
        <span class="org-keyword">do</span> <span class="org-rainbow-delimiters-depth-3">{</span>
            tail = tail_.load<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-4">)</span>;
            <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-4">(</span>tail == head_.load<span class="org-rainbow-delimiters-depth-5">(</span><span class="org-constant">std</span>::memory_order_acquire<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span> <span class="org-rainbow-delimiters-depth-4">{</span>
                <span class="org-keyword">return</span> <span class="org-constant">false</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Buffer is empty</span>
            <span class="org-rainbow-delimiters-depth-4">}</span>
            next_tail = <span class="org-rainbow-delimiters-depth-4">(</span>tail + 1<span class="org-rainbow-delimiters-depth-4">)</span> % max_size_;

            <span class="org-comment-delimiter">// </span><span class="org-comment">Attempt to update tail</span>
        <span class="org-rainbow-delimiters-depth-3">}</span> <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-negation-char">!</span>tail_.compare_exchange_weak<span class="org-rainbow-delimiters-depth-4">(</span>tail, next_tail, 
                                              <span class="org-constant">std</span>::memory_order_release,
                                              <span class="org-constant">std</span>::memory_order_relaxed<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
        item = buf_<span class="org-rainbow-delimiters-depth-3">[</span>tail<span class="org-rainbow-delimiters-depth-3">]</span>;
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-keyword">private</span>:
    <span class="org-constant">std</span>::<span class="org-type">vector</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">T</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">buf_</span>;
    <span class="org-type">size_t</span> <span class="org-variable-name">max_size_</span>;
    <span class="org-constant">std</span>::<span class="org-type">atomic</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">size_t</span><span class="org-rainbow-delimiters-depth-2">&gt;</span> <span class="org-variable-name">head_</span>, <span class="org-variable-name">tail_</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>;
</pre>
</div>

<p>
Likewise, I am skipping the <code>main</code> function part. <br />
Using GCC 13.2, this is x86 assembly for <code>put</code>:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">// </span><span class="org-comment">head = head_.load(std::memory_order_relaxed);</span>
   <span class="org-keyword">mov</span>     rcx, QWORD PTR [rsp+32]

<span class="org-comment-delimiter">// </span><span class="org-comment">next_head = (head + 1) % max_size_;</span>
   <span class="org-keyword">xor</span>     edx, edx <span class="org-comment-delimiter">// </span><span class="org-comment">'div' preparation</span>
   <span class="org-keyword">lea</span>     rax, [rcx+1]
   <span class="org-keyword">div</span>     QWORD PTR [rsp+24] 

<span class="org-comment-delimiter">// </span><span class="org-comment">tail_.load(std::memory_order_acquire)</span>
   <span class="org-keyword">mov</span>     rax, QWORD PTR [rsp+40] 

<span class="org-comment-delimiter">// </span><span class="org-comment">if (next_head == tail_) {</span>
   <span class="org-keyword">cmp</span>     rdx, rax
   <span class="org-keyword">je</span>      .L13 <span class="org-comment-delimiter">// </span><span class="org-comment">Return false</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">while (!head_.compare_exchange_weak(head, next_head, memory_order_release, memory_order_relaxed)</span>
   <span class="org-keyword">mov</span>     rax, rcx
   <span class="org-keyword">lock</span> cmpxchg    QWORD PTR [rsp+32], rdx
   <span class="org-keyword">jne</span>     .L4  

<span class="org-comment-delimiter">// </span><span class="org-comment">buf_[head] = item;</span>
   <span class="org-keyword">mov</span>     rdi, QWORD PTR [rsp]
   <span class="org-keyword">mov</span>     DWORD PTR [rdi+rax*4], 1
</pre>
</div>

<p>
This is for <code>get</code>, by the same compiler, as follows:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">// </span><span class="org-comment">tail = tail_.load(std::memory_order_relaxed);</span>
   <span class="org-keyword">mov</span>     rcx, QWORD PTR [rsp+40]
<span class="org-comment-delimiter">// </span><span class="org-comment">head_.load(std::memory_order_acquire)</span>
   <span class="org-keyword">mov</span>     rax, QWORD PTR [rsp+32]
<span class="org-comment-delimiter">// </span><span class="org-comment">if (tail == head_.load(std::memory_order_acquire)) {</span>
   <span class="org-keyword">cmp</span>     rcx, rax
   <span class="org-keyword">je</span>      .L4
<span class="org-comment-delimiter">// </span><span class="org-comment">next_tail = (tail + 1) % max_size_;</span>
   <span class="org-keyword">lea</span>     rax, [rcx+1]
   <span class="org-keyword">xor</span>     edx, edx
   <span class="org-keyword">div</span>     QWORD PTR [rsp+24]
<span class="org-comment-delimiter">// </span><span class="org-comment">while (!tail_.compare_exchange_weak(tail, next_tail, memory_order_release, memory_order_relaxed)</span>
   <span class="org-keyword">mov</span>     rax, rcx  # _25, _25
   <span class="org-keyword">lock</span> cmpxchg    QWORD PTR [rsp+40], rdx
   <span class="org-keyword">jne</span>     .L5
</pre>
</div>

<p>
No modification order is changed by the compiler.
Note that <code>cmpxchg</code> is used with <code>lock</code> prefix. This is an alternative to <code>mfence</code> in x86 which is <a href="https://preshing.com/20120515/memory-reordering-caught-in-the-act/">more expensive as a full memory berrier</a>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-01-11 Sat 00:00</p>
<p class="author">Author: Dean Seo (deaniac.seo@gmail.com)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
